HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR2.
*/
#define	SRC_CCU60SR2	(SRC_CCU6_CCU60_SR2)

/** \\brief  42C, CCU6 Service Request 3 */
#define SRC_CCU6_CCU60_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003842Cu)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR3.
*/
#define	SRC_CCU60SR3	(SRC_CCU6_CCU60_SR3)

/** \\brief  430, CCU6 Service Request 0 */
#define SRC_CCU6_CCU61_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038430u)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR0.
*/
#define	SRC_CCU61SR0	(SRC_CCU6_CCU61_SR0)

/** \\brief  434, CCU6 Service Request 1 */
#define SRC_CCU6_CCU61_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038434u)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR1.
*/
#define	SRC_CCU61SR1	(SRC_CCU6_CCU61_SR1)

/** \\brief  438, CCU6 Service Request 2 */
#define SRC_CCU6_CCU61_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038438u)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR2.
*/
#define	SRC_CCU61SR2	(SRC_CCU6_CCU61_SR2)

/** \\brief  43C, CCU6 Service Request 3 */
#define SRC_CCU6_CCU61_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003843Cu)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR3.
*/
#define	SRC_CCU61SR3	(SRC_CCU6_CCU61_SR3)

/** \\brief  440, CCU6 Service Request 0 */
#define SRC_CCU6_CCU62_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038440u)

/** Alias (User Manual Name) for SRC_CCU6_CCU62_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU62_SR0.
*/
#define	SRC_CCU62SR0	(SRC_CCU6_CCU62_SR0)

/** \\brief  444, CCU6 Service Request 1 */
#define SRC_CCU6_CCU62_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038444u)

/** Alias (User Manual Name) for SRC_CCU6_CCU62_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU62_SR1.
*/
#define	SRC_CCU62SR1	(SRC_CCU6_CCU62_SR1)

/** \\brief  448, CCU6 Service Request 2 */
#define SRC_CCU6_CCU62_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038448u)

/** Alias (User Manual Name) for SRC_CCU6_CCU62_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU62_SR2.
*/
#define	SRC_CCU62SR2	(SRC_CCU6_CCU62_SR2)

/** \\brief  44C, CCU6 Service Request 3 */
#define SRC_CCU6_CCU62_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003844Cu)

/** Alias (User Manual Name) for SRC_CCU6_CCU62_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU62_SR3.
*/
#define	SRC_CCU62SR3	(SRC_CCU6_CCU62_SR3)

/** \\brief  450, CCU6 Service Request 0 */
#define SRC_CCU6_CCU63_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038450u)

/** Alias (User Manual Name) for SRC_CCU6_CCU63_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU63_SR0.
*/
#define	SRC_CCU63SR0	(SRC_CCU6_CCU63_SR0)

/** \\brief  454, CCU6 Service Request 1 */
#define SRC_CCU6_CCU63_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038454u)

/** Alias (User Manual Name) for SRC_CCU6_CCU63_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU63_SR1.
*/
#define	SRC_CCU63SR1	(SRC_CCU6_CCU63_SR1)

/** \\brief  458, CCU6 Service Request 2 */
#define SRC_CCU6_CCU63_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038458u)

/** Alias (User Manual Name) for SRC_CCU6_CCU63_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU63_SR2.
*/
#define	SRC_CCU63SR2	(SRC_CCU6_CCU63_SR2)

/** \\brief  45C, CCU6 Service Request 3 */
#define SRC_CCU6_CCU63_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003845Cu)

/** Alias (User Manual Name) for SRC_CCU6_CCU63_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU63_SR3.
*/
#define	SRC_CCU63SR3	(SRC_CCU6_CCU63_SR3)

/** \\brief  50, Cerberus Service Request */
#define SRC_CERBERUS_CERBERUS_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038050u)

/** Alias (User Manual Name) for SRC_CERBERUS_CERBERUS_SR0.
* To use register names with standard convension, please use SRC_CERBERUS_CERBERUS_SR0.
*/
#define	SRC_CERBERUS0	(SRC_CERBERUS_CERBERUS_SR0)

/** \\brief  54, Cerberus Service Request */
#define SRC_CERBERUS_CERBERUS_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038054u)

/** Alias (User Manual Name) for SRC_CERBERUS_CERBERUS_SR1.
* To use register names with standard convension, please use SRC_CERBERUS_CERBERUS_SR1.
*/
#define	SRC_CERBERUS1	(SRC_CERBERUS_CERBERUS_SR1)

/** \\brief  DA8, CIF ISP Service Request */
#define SRC_CIF_CIF0_ISP /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA8u)

/** Alias (User Manual Name) for SRC_CIF_CIF0_ISP.
* To use register names with standard convension, please use SRC_CIF_CIF0_ISP.
*/
#define	SRC_CIFISP	(SRC_CIF_CIF0_ISP)

/** \\brief  DA0, CIF MI Service Request */
#define SRC_CIF_CIF0_MI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA0u)

/** Alias (User Manual Name) for SRC_CIF_CIF0_MI.
* To use register names with standard convension, please use SRC_CIF_CIF0_MI.
*/
#define	SRC_CIFMI	(SRC_CIF_CIF0_MI)

/** \\brief  DA4, CIF MI EP Service Request */
#define SRC_CIF_CIF0_MIEP /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA4u)

/** Alias (User Manual Name) for SRC_CIF_CIF0_MIEP.
* To use register names with standard convension, please use SRC_CIF_CIF0_MIEP.
*/
#define	SRC_CIFMIEP	(SRC_CIF_CIF0_MIEP)

/** \\brief  DAC, CIF MJPEG Service Request */
#define SRC_CIF_CIF0_MJPEG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DACu)

/** Alias (User Manual Name) for SRC_CIF_CIF0_MJPEG.
* To use register names with standard convension, please use SRC_CIF_CIF0_MJPEG.
*/
#define	SRC_CIFMJPEG	(SRC_CIF_CIF0_MJPEG)

/** \\brief  0, CPU Software Breakpoint Service Request */
#define SRC_CPU_CPU0_SBSRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038000u)

/** Alias (User Manual Name) for SRC_CPU_CPU0_SBSRC.
* To use register names with standard convension, please use SRC_CPU_CPU0_SBSRC.
*/
#define	SRC_CPU0SBSRC	(SRC_CPU_CPU0_SBSRC)

/** \\brief  4, CPU Software Breakpoint Service Request */
#define SRC_CPU_CPU1_SBSRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038004u)

/** Alias (User Manual Name) for SRC_CPU_CPU1_SBSRC.
* To use register names with standard convension, please use SRC_CPU_CPU1_SBSRC.
*/
#define	SRC_CPU1SBSRC	(SRC_CPU_CPU1_SBSRC)

/** \\brief  8, CPU Software Breakpoint Service Request */
#define SRC_CPU_CPU2_SBSRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038008u)

/** Alias (User Manual Name) for SRC_CPU_CPU2_SBSRC.
* To use register names with standard convension, please use SRC_CPU_CPU2_SBSRC.
*/
#define	SRC_CPU2SBSRC	(SRC_CPU_CPU2_SBSRC)

/** \\brief  D70, DAM Service Request */
#define SRC_DAM_DAM0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D70u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR0.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR0.
*/
#define	SRC_DAM0	(SRC_DAM_DAM0_SR0)

