HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** \\brief  D74, DAM Service Request */
#define SRC_DAM_DAM0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D74u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR1.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR1.
*/
#define	SRC_DAM1	(SRC_DAM_DAM0_SR1)

/** \\brief  D78, DAM Service Request */
#define SRC_DAM_DAM0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D78u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR2.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR2.
*/
#define	SRC_DAM2	(SRC_DAM_DAM0_SR2)

/** \\brief  D7C, DAM Service Request */
#define SRC_DAM_DAM0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D7Cu)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR3.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR3.
*/
#define	SRC_DAM3	(SRC_DAM_DAM0_SR3)

/** \\brief  D80, DAM Service Request */
#define SRC_DAM_DAM0_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D80u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR4.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR4.
*/
#define	SRC_DAM4	(SRC_DAM_DAM0_SR4)

/** \\brief  D84, DAM Service Request */
#define SRC_DAM_DAM0_SR5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D84u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR5.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR5.
*/
#define	SRC_DAM5	(SRC_DAM_DAM0_SR5)

/** \\brief  6F0, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH0.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH0.
*/
#define	SRC_DMAME0CH0	(SRC_DMA_DMA_ME0_CH0)

/** \\brief  6F4, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F4u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH1.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH1.
*/
#define	SRC_DMAME0CH1	(SRC_DMA_DMA_ME0_CH1)

/** \\brief  718, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038718u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH10.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH10.
*/
#define	SRC_DMAME0CH10	(SRC_DMA_DMA_ME0_CH10)

/** \\brief  71C, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003871Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH11.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH11.
*/
#define	SRC_DMAME0CH11	(SRC_DMA_DMA_ME0_CH11)

/** \\brief  720, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038720u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH12.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH12.
*/
#define	SRC_DMAME0CH12	(SRC_DMA_DMA_ME0_CH12)

/** \\brief  724, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038724u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH13.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH13.
*/
#define	SRC_DMAME0CH13	(SRC_DMA_DMA_ME0_CH13)

/** \\brief  728, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038728u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH14.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH14.
*/
#define	SRC_DMAME0CH14	(SRC_DMA_DMA_ME0_CH14)

/** \\brief  72C, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003872Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH15.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH15.
*/
#define	SRC_DMAME0CH15	(SRC_DMA_DMA_ME0_CH15)

/** \\brief  730, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH16 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038730u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH16.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH16.
*/
#define	SRC_DMAME0CH16	(SRC_DMA_DMA_ME0_CH16)

/** \\brief  734, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH17 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038734u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH17.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH17.
*/
#define	SRC_DMAME0CH17	(SRC_DMA_DMA_ME0_CH17)

/** \\brief  738, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH18 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038738u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH18.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH18.
*/
#define	SRC_DMAME0CH18	(SRC_DMA_DMA_ME0_CH18)

/** \\brief  73C, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH19 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003873Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH19.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH19.
*/
#define	SRC_DMAME0CH19	(SRC_DMA_DMA_ME0_CH19)

/** \\brief  6F8, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F8u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH2.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH2.
*/
#define	SRC_DMAME0CH2	(SRC_DMA_DMA_ME0_CH2)

/** \\brief  740, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH20 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038740u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH20.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH20.
*/
#define	SRC_DMAME0CH20	(SRC_DMA_DMA_ME0_CH20)

/** \\brief  744, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH21 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038744u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH21.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH21.
*/
#define	SRC_DMAME0CH21	(SRC_DMA_DMA_ME0_CH21)

/** \\brief  748, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH22 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038748u)

