HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH22.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH22.
*/
#define	SRC_DMAME0CH22	(SRC_DMA_DMA_ME0_CH22)

/** \\brief  74C, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH23 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003874Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH23.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH23.
*/
#define	SRC_DMAME0CH23	(SRC_DMA_DMA_ME0_CH23)

/** \\brief  6FC, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386FCu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH3.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH3.
*/
#define	SRC_DMAME0CH3	(SRC_DMA_DMA_ME0_CH3)

/** \\brief  700, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038700u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH4.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH4.
*/
#define	SRC_DMAME0CH4	(SRC_DMA_DMA_ME0_CH4)

/** \\brief  704, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038704u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH5.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH5.
*/
#define	SRC_DMAME0CH5	(SRC_DMA_DMA_ME0_CH5)

/** \\brief  708, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038708u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH6.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH6.
*/
#define	SRC_DMAME0CH6	(SRC_DMA_DMA_ME0_CH6)

/** \\brief  70C, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003870Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH7.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH7.
*/
#define	SRC_DMAME0CH7	(SRC_DMA_DMA_ME0_CH7)

/** \\brief  710, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038710u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH8.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH8.
*/
#define	SRC_DMAME0CH8	(SRC_DMA_DMA_ME0_CH8)

/** \\brief  714, Channel Service Request */
#define SRC_DMA_DMA_ME0_CH9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038714u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME0_CH9.
* To use register names with standard convension, please use SRC_DMA_DMA_ME0_CH9.
*/
#define	SRC_DMAME0CH9	(SRC_DMA_DMA_ME0_CH9)

/** \\brief  7F0, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH0.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH0.
*/
#define	SRC_DMAME1CH0	(SRC_DMA_DMA_ME1_CH0)

/** \\brief  7F4, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387F4u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH1.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH1.
*/
#define	SRC_DMAME1CH1	(SRC_DMA_DMA_ME1_CH1)

/** \\brief  818, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038818u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH10.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH10.
*/
#define	SRC_DMAME1CH10	(SRC_DMA_DMA_ME1_CH10)

/** \\brief  81C, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003881Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH11.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH11.
*/
#define	SRC_DMAME1CH11	(SRC_DMA_DMA_ME1_CH11)

/** \\brief  820, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038820u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH12.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH12.
*/
#define	SRC_DMAME1CH12	(SRC_DMA_DMA_ME1_CH12)

/** \\brief  824, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038824u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH13.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH13.
*/
#define	SRC_DMAME1CH13	(SRC_DMA_DMA_ME1_CH13)

/** \\brief  828, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038828u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH14.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH14.
*/
#define	SRC_DMAME1CH14	(SRC_DMA_DMA_ME1_CH14)

/** \\brief  82C, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003882Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH15.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH15.
*/
#define	SRC_DMAME1CH15	(SRC_DMA_DMA_ME1_CH15)

/** \\brief  830, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH16 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038830u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH16.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH16.
*/
#define	SRC_DMAME1CH16	(SRC_DMA_DMA_ME1_CH16)

/** \\brief  834, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH17 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038834u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH17.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH17.
*/
#define	SRC_DMAME1CH17	(SRC_DMA_DMA_ME1_CH17)

/** \\brief  838, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH18 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038838u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH18.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH18.
*/
#define	SRC_DMAME1CH18	(SRC_DMA_DMA_ME1_CH18)

/** \\brief  83C, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH19 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003883Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH19.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH19.
*/
#define	SRC_DMAME1CH19	(SRC_DMA_DMA_ME1_CH19)

/** \\brief  7F8, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387F8u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH2.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH2.
*/
#define	SRC_DMAME1CH2	(SRC_DMA_DMA_ME1_CH2)

