HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** \\brief  840, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH20 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038840u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH20.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH20.
*/
#define	SRC_DMAME1CH20	(SRC_DMA_DMA_ME1_CH20)

/** \\brief  844, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH21 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038844u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH21.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH21.
*/
#define	SRC_DMAME1CH21	(SRC_DMA_DMA_ME1_CH21)

/** \\brief  848, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH22 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038848u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH22.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH22.
*/
#define	SRC_DMAME1CH22	(SRC_DMA_DMA_ME1_CH22)

/** \\brief  84C, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH23 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003884Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH23.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH23.
*/
#define	SRC_DMAME1CH23	(SRC_DMA_DMA_ME1_CH23)

/** \\brief  7FC, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387FCu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH3.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH3.
*/
#define	SRC_DMAME1CH3	(SRC_DMA_DMA_ME1_CH3)

/** \\brief  800, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038800u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH4.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH4.
*/
#define	SRC_DMAME1CH4	(SRC_DMA_DMA_ME1_CH4)

/** \\brief  804, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038804u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH5.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH5.
*/
#define	SRC_DMAME1CH5	(SRC_DMA_DMA_ME1_CH5)

/** \\brief  808, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038808u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH6.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH6.
*/
#define	SRC_DMAME1CH6	(SRC_DMA_DMA_ME1_CH6)

/** \\brief  80C, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003880Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH7.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH7.
*/
#define	SRC_DMAME1CH7	(SRC_DMA_DMA_ME1_CH7)

/** \\brief  810, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038810u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH8.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH8.
*/
#define	SRC_DMAME1CH8	(SRC_DMA_DMA_ME1_CH8)

/** \\brief  814, Channel Service Request */
#define SRC_DMA_DMA_ME1_CH9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038814u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME1_CH9.
* To use register names with standard convension, please use SRC_DMA_DMA_ME1_CH9.
*/
#define	SRC_DMAME1CH9	(SRC_DMA_DMA_ME1_CH9)

/** \\brief  4D8, DMA Move Engine Service Request */
#define SRC_DMA_DMA_ME_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D8u)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME_SR0.
* To use register names with standard convension, please use SRC_DMA_DMA_ME_SR0.
*/
#define	SRC_DMAME0	(SRC_DMA_DMA_ME_SR0)

/** \\brief  4DC, DMA Move Engine Service Request */
#define SRC_DMA_DMA_ME_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384DCu)

/** Alias (User Manual Name) for SRC_DMA_DMA_ME_SR1.
* To use register names with standard convension, please use SRC_DMA_DMA_ME_SR1.
*/
#define	SRC_DMAME1	(SRC_DMA_DMA_ME_SR1)

/** \\brief  4F0, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH0.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH0.
*/
#define	SRC_SDMAME0CH0	(SRC_DMA_SDMA_ME0_CH0)

/** \\brief  4F4, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F4u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH1.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH1.
*/
#define	SRC_SDMAME0CH1	(SRC_DMA_SDMA_ME0_CH1)

/** \\brief  4F8, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F8u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH2.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH2.
*/
#define	SRC_SDMAME0CH2	(SRC_DMA_SDMA_ME0_CH2)

/** \\brief  4FC, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384FCu)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH3.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH3.
*/
#define	SRC_SDMAME0CH3	(SRC_DMA_SDMA_ME0_CH3)

/** \\brief  500, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038500u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH4.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH4.
*/
#define	SRC_SDMAME0CH4	(SRC_DMA_SDMA_ME0_CH4)

/** \\brief  504, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038504u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH5.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH5.
*/
#define	SRC_SDMAME0CH5	(SRC_DMA_SDMA_ME0_CH5)

/** \\brief  508, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038508u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH6.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH6.
*/
#define	SRC_SDMAME0CH6	(SRC_DMA_SDMA_ME0_CH6)

