HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** \\brief  50C, Channel Service Request */
#define SRC_DMA_SDMA_ME0_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003850Cu)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME0_CH7.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME0_CH7.
*/
#define	SRC_SDMAME0CH7	(SRC_DMA_SDMA_ME0_CH7)

/** \\brief  5F0, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F0u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH0.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH0.
*/
#define	SRC_SDMAME1CH0	(SRC_DMA_SDMA_ME1_CH0)

/** \\brief  5F4, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F4u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH1.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH1.
*/
#define	SRC_SDMAME1CH1	(SRC_DMA_SDMA_ME1_CH1)

/** \\brief  5F8, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F8u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH2.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH2.
*/
#define	SRC_SDMAME1CH2	(SRC_DMA_SDMA_ME1_CH2)

/** \\brief  5FC, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385FCu)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH3.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH3.
*/
#define	SRC_SDMAME1CH3	(SRC_DMA_SDMA_ME1_CH3)

/** \\brief  600, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038600u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH4.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH4.
*/
#define	SRC_SDMAME1CH4	(SRC_DMA_SDMA_ME1_CH4)

/** \\brief  604, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038604u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH5.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH5.
*/
#define	SRC_SDMAME1CH5	(SRC_DMA_SDMA_ME1_CH5)

/** \\brief  608, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038608u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH6.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH6.
*/
#define	SRC_SDMAME1CH6	(SRC_DMA_SDMA_ME1_CH6)

/** \\brief  60C, Channel Service Request */
#define SRC_DMA_SDMA_ME1_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003860Cu)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME1_CH7.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME1_CH7.
*/
#define	SRC_SDMAME1CH7	(SRC_DMA_SDMA_ME1_CH7)

/** \\brief  4D0, SDMA Move Engine Service Request */
#define SRC_DMA_SDMA_ME_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D0u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME_SR0.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME_SR0.
*/
#define	SRC_SDMAME0	(SRC_DMA_SDMA_ME_SR0)

/** \\brief  4D4, SDMA Move Engine Service Request */
#define SRC_DMA_SDMA_ME_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D4u)

/** Alias (User Manual Name) for SRC_DMA_SDMA_ME_SR1.
* To use register names with standard convension, please use SRC_DMA_SDMA_ME_SR1.
*/
#define	SRC_SDMAME1	(SRC_DMA_SDMA_ME_SR1)

/** \\brief  B94, DSADC SRA Service Request */
#define SRC_DSADC_DSADC0_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B94u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRA.
*/
#define	SRC_DSADCSRA0	(SRC_DSADC_DSADC0_SRA)

/** \\brief  B90, DSADC SRM Service Request */
#define SRC_DSADC_DSADC0_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B90u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRM.
*/
#define	SRC_DSADCSRM0	(SRC_DSADC_DSADC0_SRM)

/** \\brief  B9C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC1_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B9Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRA.
*/
#define	SRC_DSADCSRA1	(SRC_DSADC_DSADC1_SRA)

/** \\brief  B98, DSADC SRM Service Request */
#define SRC_DSADC_DSADC1_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B98u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRM.
*/
#define	SRC_DSADCSRM1	(SRC_DSADC_DSADC1_SRM)

/** \\brief  BA4, DSADC SRA Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA4u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define	SRC_DSADCSRA2	(SRC_DSADC_DSADC2_SRA)

/** \\brief  BA0, DSADC SRM Service Request */
#define SRC_DSADC_DSADC2_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA0u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRM.
*/
#define	SRC_DSADCSRM2	(SRC_DSADC_DSADC2_SRM)

/** \\brief  BAC, DSADC SRA Service Request */
#define SRC_DSADC_DSADC3_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BACu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRA.
*/
#define	SRC_DSADCSRA3	(SRC_DSADC_DSADC3_SRA)

/** \\brief  BA8, DSADC SRM Service Request */
#define SRC_DSADC_DSADC3_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA8u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRM.
*/
#define	SRC_DSADCSRM3	(SRC_DSADC_DSADC3_SRM)

/** \\brief  BB4, DSADC SRA Service Request */
#define SRC_DSADC_DSADC4_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB4u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRA.
*/
#define	SRC_DSADCSRA4	(SRC_DSADC_DSADC4_SRA)

/** \\brief  BB0, DSADC SRM Service Request */
#define SRC_DSADC_DSADC4_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB0u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRM.
*/
#define	SRC_DSADCSRM4	(SRC_DSADC_DSADC4_SRM)

/** \\brief  BBC, DSADC SRA Service Request */
#define SRC_DSADC_DSADC5_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BBCu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRA.
*/
#define	SRC_DSADCSRA5	(SRC_DSADC_DSADC5_SRA)

/** \\brief  BB8, DSADC SRM Service Request */
#define SRC_DSADC_DSADC5_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB8u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRM.
*/
#define	SRC_DSADCSRM5	(SRC_DSADC_DSADC5_SRM)

