HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GPSR_GPSR1_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR1_SR2.
*/
#define	SRC_GPSR12	(SRC_GPSR_GPSR1_SR2)

/** \\brief  102C, General Purpose Service Request 3 */
#define SRC_GPSR_GPSR1_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003902Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR1_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR1_SR3.
*/
#define	SRC_GPSR13	(SRC_GPSR_GPSR1_SR3)

/** \\brief  1040, General Purpose Service Request 0 */
#define SRC_GPSR_GPSR2_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039040u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR0.
*/
#define	SRC_GPSR20	(SRC_GPSR_GPSR2_SR0)

/** \\brief  1044, General Purpose Service Request 1 */
#define SRC_GPSR_GPSR2_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039044u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR1.
*/
#define	SRC_GPSR21	(SRC_GPSR_GPSR2_SR1)

/** \\brief  1048, General Purpose Service Request 2 */
#define SRC_GPSR_GPSR2_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039048u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR2.
*/
#define	SRC_GPSR22	(SRC_GPSR_GPSR2_SR2)

/** \\brief  104C, General Purpose Service Request 3 */
#define SRC_GPSR_GPSR2_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003904Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR3.
*/
#define	SRC_GPSR23	(SRC_GPSR_GPSR2_SR3)

/** \\brief  460, GPT12 CAPREL Service Request */
#define SRC_GPT12_GPT120_CIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038460u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_CIRQ.
* To use register names with standard convension, please use SRC_GPT12_GPT120_CIRQ.
*/
#define	SRC_GPT120CIRQ	(SRC_GPT12_GPT120_CIRQ)

/** \\brief  464, GPT12 T2 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038464u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T2.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T2.
*/
#define	SRC_GPT120T2	(SRC_GPT12_GPT120_T2)

/** \\brief  468, GPT12 T3 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038468u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T3.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T3.
*/
#define	SRC_GPT120T3	(SRC_GPT12_GPT120_T3)

/** \\brief  46C, GPT12 T4 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003846Cu)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T4.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T4.
*/
#define	SRC_GPT120T4	(SRC_GPT12_GPT120_T4)

/** \\brief  470, GPT12 T5 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038470u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T5.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T5.
*/
#define	SRC_GPT120T5	(SRC_GPT12_GPT120_T5)

/** \\brief  474, GPT12 T6 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT120_T6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038474u)

/** Alias (User Manual Name) for SRC_GPT12_GPT120_T6.
* To use register names with standard convension, please use SRC_GPT12_GPT120_T6.
*/
#define	SRC_GPT120T6	(SRC_GPT12_GPT120_T6)

/** \\brief  478, GPT12 CAPREL Service Request */
#define SRC_GPT12_GPT121_CIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038478u)

/** Alias (User Manual Name) for SRC_GPT12_GPT121_CIRQ.
* To use register names with standard convension, please use SRC_GPT12_GPT121_CIRQ.
*/
#define	SRC_GPT121CIRQ	(SRC_GPT12_GPT121_CIRQ)

/** \\brief  47C, GPT12 T2 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT121_T2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003847Cu)

/** Alias (User Manual Name) for SRC_GPT12_GPT121_T2.
* To use register names with standard convension, please use SRC_GPT12_GPT121_T2.
*/
#define	SRC_GPT121T2	(SRC_GPT12_GPT121_T2)

/** \\brief  480, GPT12 T3 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT121_T3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038480u)

/** Alias (User Manual Name) for SRC_GPT12_GPT121_T3.
* To use register names with standard convension, please use SRC_GPT12_GPT121_T3.
*/
#define	SRC_GPT121T3	(SRC_GPT12_GPT121_T3)

/** \\brief  484, GPT12 T4 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT121_T4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038484u)

/** Alias (User Manual Name) for SRC_GPT12_GPT121_T4.
* To use register names with standard convension, please use SRC_GPT12_GPT121_T4.
*/
#define	SRC_GPT121T4	(SRC_GPT12_GPT121_T4)

/** \\brief  488, GPT12 T5 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT121_T5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038488u)

/** Alias (User Manual Name) for SRC_GPT12_GPT121_T5.
* To use register names with standard convension, please use SRC_GPT12_GPT121_T5.
*/
#define	SRC_GPT121T5	(SRC_GPT12_GPT121_T5)

/** \\brief  48C, GPT12 T6 Overflow/Underflow Service Request */
#define SRC_GPT12_GPT121_T6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003848Cu)

/** Alias (User Manual Name) for SRC_GPT12_GPT121_T6.
* To use register names with standard convension, please use SRC_GPT12_GPT121_T6.
*/
#define	SRC_GPT121T6	(SRC_GPT12_GPT121_T6)

/** \\brief  1600, GTM AEI Shared Service Request */
#define SRC_GTM_GTM0_AEIIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039600u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_AEIIRQ.
* To use register names with standard convension, please use SRC_GTM_GTM0_AEIIRQ.
*/
#define	SRC_GTMAEIIRQ	(SRC_GTM_GTM0_AEIIRQ)

