HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSrc_reg.h
/** \\brief  19E8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399E8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_2.
*/
#define	SRC_GTMMCS32	(SRC_GTM_GTM0_MCS3_2)

/** \\brief  19EC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399ECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_3.
*/
#define	SRC_GTMMCS33	(SRC_GTM_GTM0_MCS3_3)

/** \\brief  19F0, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399F0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_4.
*/
#define	SRC_GTMMCS34	(SRC_GTM_GTM0_MCS3_4)

/** \\brief  19F4, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399F4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_5.
*/
#define	SRC_GTMMCS35	(SRC_GTM_GTM0_MCS3_5)

/** \\brief  19F8, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399F8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_6.
*/
#define	SRC_GTMMCS36	(SRC_GTM_GTM0_MCS3_6)

/** \\brief  19FC, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00399FCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_7.
*/
#define	SRC_GTMMCS37	(SRC_GTM_GTM0_MCS3_7)

/** \\brief  1F00, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW00 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW00.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW00.
*/
#define	SRC_GTMMCSW00	(SRC_GTM_GTM0_MCSW00)

/** \\brief  1F04, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW01 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW01.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW01.
*/
#define	SRC_GTMMCSW01	(SRC_GTM_GTM0_MCSW01)

/** \\brief  1F08, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW10.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW10.
*/
#define	SRC_GTMMCSW10	(SRC_GTM_GTM0_MCSW10)

/** \\brief  1F0C, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW11.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW11.
*/
#define	SRC_GTMMCSW11	(SRC_GTM_GTM0_MCSW11)

/** \\brief  1F10, GTM Multi Channel Sequencer 2 Service Request */
#define SRC_GTM_GTM0_MCSW20 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW20.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW20.
*/
#define	SRC_GTMMCSW20	(SRC_GTM_GTM0_MCSW20)

/** \\brief  1F14, GTM Multi Channel Sequencer 2 Service Request */
#define SRC_GTM_GTM0_MCSW21 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW21.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW21.
*/
#define	SRC_GTMMCSW21	(SRC_GTM_GTM0_MCSW21)

/** \\brief  1F18, GTM Multi Channel Sequencer 2 Service Request */
#define SRC_GTM_GTM0_MCSW30 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW30.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW30.
*/
#define	SRC_GTMMCSW30	(SRC_GTM_GTM0_MCSW30)

/** \\brief  1F1C, GTM Multi Channel Sequencer 2 Service Request */
#define SRC_GTM_GTM0_MCSW31 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F1Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW31.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW31.
*/
#define	SRC_GTMMCSW31	(SRC_GTM_GTM0_MCSW31)

/** \\brief  1624, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039624u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_0.
*/
#define	SRC_GTMPSM00	(SRC_GTM_GTM0_PSM0_0)

/** \\brief  1628, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039628u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_1.
*/
#define	SRC_GTMPSM01	(SRC_GTM_GTM0_PSM0_1)

/** \\brief  162C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003962Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_2.
*/
#define	SRC_GTMPSM02	(SRC_GTM_GTM0_PSM0_2)

/** \\brief  1630, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039630u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_3.
*/
#define	SRC_GTMPSM03	(SRC_GTM_GTM0_PSM0_3)

/** \\brief  1634, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039634u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_4.
*/
#define	SRC_GTMPSM04	(SRC_GTM_GTM0_PSM0_4)

/** \\brief  1638, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039638u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_5.
*/
#define	SRC_GTMPSM05	(SRC_GTM_GTM0_PSM0_5)

/** \\brief  163C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003963Cu)

